# StudyPython22
2022 빅데이터 분석 과정 - 파이썬 기초 학습

![파이썬](./image/python_logo.png)
<!-- 
<img src='./image/python_logo.png' />  
-->

### 1일차
- 파이썬 개발환경
- 콘솔출력
- 기본 문법
    - 변수, 변수 사용법
    - 데이터 타입
        - None
        - 정수형
        - 실수형
        - 문자열형 (파이썬 문자형은 없음)
        - 불형
        - 리스트형
        - 튜플형
        - 딕셔너리형
        - 셋형
    - 연산자
        - 사칙연산
        - 문자열 연산
        - 문자열 포맷팅
        
- 베이스 실행코드 구조

### 2일차
- 기본 문법
- 베이스 실행코드 구조

### 3일차
- 기본 문법
- 베이스 실행코드 구조

### 4일차
- 기본 문법
- 베이스 실행코드 구조

### 5일차
- 기본 문법
- 베이스 실행코드 구조

### 6일차
- 기본 문법
- 베이스 실행코드 구조